---
kind: property
id: P:Autodesk.Revit.DB.BuiltInFailures.RoomFailures.OptionConflictRoomOverlapOption
source: html/c1a22e1d-c836-5759-8245-66c2e5b0c71c.htm
---
# Autodesk.Revit.DB.BuiltInFailures.RoomFailures.OptionConflictRoomOverlapOption Property

Option Conflict between Rooms.\nRoom in Option '[Option Name]' overlaps Room in Option '[Option Name]'.\nTo resolve, delete the duplicate Room or divide space with Room Separation Lines in the Main Model.

## Syntax (C#)
```csharp
public static FailureDefinitionId OptionConflictRoomOverlapOption { get; }
```